Config/DataProcessors/ЮЦАУ_ЗаполнениеКоэффицентовЗакрытияСчета2502.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЮЦАУ_ЗаполнениеКоэффицентовЗакрытияСчета2502</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДт20</Name>
					<Comment>Подразделение Дт 20.01</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/AccumulationRegisters/ЮЦАУ_ОборотыПоМаршрутам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЮЦАУ_ОборотыПоМаршрутам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РабочееВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПассажиров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕздок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПробегСПассажирами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮЦАУ_Маршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Documents/ЮЦАУ_НастройкаЗакрытияСчета25_02.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЮЦАУ_НастройкаЗакрытияСчета25_02</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияТоваровНаСкладе</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЮЦАУ_НастройкиЗакрытияСчета25_02</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКт25</Name>
					<Comment>Подразделение Кт 25.02</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДт20</Name>
					<Comment>Подразделение Дт 20.01</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРаспределять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень подразделений кт. 25.02, включенных в документ </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкаЗакрытия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Comment>Номенклатурная группа</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКт25</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/DataProcessors/ЮЦАУ_ЗаполнениеКоэффицентовЗакрытияСчета2502/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Объект.ДатаПериода = НачалоМесяца(ТекущаяДата());
	Объект.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Объект.ПодразделениеДт20 = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПодразделениеОсновноеПодразделение", Объект.Организация, Объект.ДатаПериода);
	ПодготовитьФормуНаСервере();

КонецПроцедуры


&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	//Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
	//	ВидОперации = Перечисления.ВидыОперацийСписаниеТоваров.СписаниеСоСклада;
	//КонецЕсли;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "Объект.ДатаПериода", "ПериодЗаполненияСтрокой");
	
	//УстановитьСвойстваФормыДляОперацииСписаниеСоСклада();
	
	//УстановитьСостояниеДокумента();
	
	УправлениеФормойНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаполненияСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Объект.ДатаПериода", "ПериодЗаполненияСтрокой", Модифицированность);
	//ОбработатьИзменениеПериодаЗаполненияНаСервере();
	УправлениеФормойНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаполненияСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораПериода = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(Объект.ДатаПериода), КонецМесяца(Объект.ДатаПериода));
	ОписаниеОповещения     = Новый ОписаниеОповещения("ПериодЗаполненияСтрокойНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбораПериода, Элементы.ПериодЗаполненияСтрокой, , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаполненияСтрокойНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаПериода = РезультатВыбора.НачалоПериода;
	УправлениеФормойНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаполненияСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Объект.ДатаПериода", "ПериодЗаполненияСтрокой", Направление, Модифицированность);
//	ПодключитьОбработчикОжидания("ОбработчикОжиданияМесяцНачисленияПриИзменении", 0.3, Истина);
	УправлениеФормойНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаполненияСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);   
	//УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗаполненияСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	//УправлениеФормой(ЭтаФорма);
КонецПроцедуры


//&НаКлиентеНаСервереБезКонтекста
&НаСервере
Процедура УправлениеФормойНаСервере()

	//Зачистка отбора по дате
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Дата");
	
	//Установка отбора по дате
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Дата", КонецМесяца(Объект.ДатаПериода), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Дата", НачалоМесяца(Объект.ДатаПериода), ВидСравненияКомпоновкиДанных.БольшеИлиРавно);

КонецПроцедуры	


&НаСервере
Функция СуществуютДокументыНастройкаЗакрытияСчета25_02(Организация, ДатаНач, ДатаКон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_НастройкаЗакрытияСчета25_02.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЮЦАУ_НастройкаЗакрытияСчета25_02 КАК ЮЦАУ_НастройкаЗакрытияСчета25_02
		|ГДЕ
		|	ЮЦАУ_НастройкаЗакрытияСчета25_02.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЮЦАУ_НастройкаЗакрытияСчета25_02.Организация = &Организация";
	
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Возврат Истина;
	Иначе	           
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции


&НаСервере
Процедура ЗаполнитьДокументыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.КатегорияТС.ПодразделениеЗатрат КАК ПодразделениеКт25,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.РабочееВремяОборот КАК РабочееВремя
		|ИЗ
		|	РегистрНакопления.ЮЦАУ_ОборотыПоМаршрутам.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			Организация = &Организация
		|				И СчетЗатрат = &СчетЗатрат) КАК ЮЦАУ_ОборотыПоМаршрутамОбороты
		|ИТОГИ
		|	СУММА(РабочееВремяОборот)
		|ПО
		|	ОБЩИЕ,
		|	ПодразделениеКт25,
		|	НоменклатурнаяГруппа";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ДатаПериода));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ДатаПериода));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетЗатрат", ПланыСчетов.Хозрасчетный.ЭксплуатацияДорожнойТехники);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	ВыборкаПодразделениеКт25 = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПодразделениеКт25.Следующий() Цикл
		
		ДокОбъект = ПолучитьДокументНастройкаЗакрытияСчета25_02(Объект.Организация, Объект.ДатаПериода, Объект.ПодразделениеДт20, ВыборкаПодразделениеКт25.ПодразделениеКт25);
		ДокОбъект.НастройкаЗакрытия.Очистить();
		
		МассивКоэффициентов = Новый Массив;
		
		ВыборкаНоменклатурнаяГруппа = ВыборкаПодразделениеКт25.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатурнаяГруппа.Следующий() Цикл
			НоваяСтрока = ДокОбъект.НастройкаЗакрытия.Добавить();
			НоваяСтрока.НоменклатурнаяГруппа = ВыборкаНоменклатурнаяГруппа.НоменклатурнаяГруппа; 
			
			МассивКоэффициентов.Добавить(ВыборкаНоменклатурнаяГруппа.РабочееВремя);
			
		КонецЦикла;

		МассивРаспределенныхСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(100, МассивКоэффициентов, 3);		
		
		//Добавление коэффициентов в таблицу документа
		Для Каждого ТекСтрока Из ДокОбъект.НастройкаЗакрытия Цикл
			ТекСтрока.Коэффициент = МассивРаспределенныхСумм[ТекСтрока.НомерСтроки-1];
		КонецЦикла;	
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументы(Команда)  
	
	Если СуществуютДокументыНастройкаЗакрытияСчета25_02(Объект.Организация, НачалоМесяца(Объект.ДатаПериода), КонецМесяца(Объект.ДатаПериода)) Тогда
		
		ТекстВопроса = НСтр("ru = 'Существующие документы будут перезаполнены. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПередФормированиемДокументовЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,
			НСтр("ru = 'Формирование документов'"));
	
	Иначе	
		ЗаполнитьДокументыНаСервере();
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ВопросПередФормированиемДокументовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДокументыНаСервере();
	КонецЕсли;
	
КонецПроцедуры


Функция ПолучитьДокументНастройкаЗакрытияСчета25_02(Организация, ДатаПериода, ПодразделениеДт20, ПодразделениеКт25)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_НастройкаЗакрытияСчета25_02.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЮЦАУ_НастройкаЗакрытияСчета25_02 КАК ЮЦАУ_НастройкаЗакрытияСчета25_02
		|ГДЕ
		|	ЮЦАУ_НастройкаЗакрытияСчета25_02.Организация = &Организация
		|	И ЮЦАУ_НастройкаЗакрытияСчета25_02.ПодразделениеДт20 = &ПодразделениеДт20
		|	И ЮЦАУ_НастройкаЗакрытияСчета25_02.ПодразделениеКт25 = &ПодразделениеКт25
		|	И НАЧАЛОПЕРИОДА(ЮЦАУ_НастройкаЗакрытияСчета25_02.Дата, День) = &Дата";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(КонецМесяца(ДатаПериода)));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПодразделениеДт20", ПодразделениеДт20);
	Запрос.УстановитьПараметр("ПодразделениеКт25", ПодразделениеКт25);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	ДокОбъект = Документы.ЮЦАУ_НастройкаЗакрытияСчета25_02.СоздатьДокумент();
	
	ДокОбъект.Дата = КонецМесяца(ДатаПериода);
	ДокОбъект.Организация = Организация;
	ДокОбъект.ПодразделениеДт20 = ПодразделениеДт20;
	ДокОбъект.ПодразделениеКт25 = ПодразделениеКт25;

	Возврат ДокОбъект;
	
КонецФункции
